Revit 2027 API
BuiltInFailures.PartMakerMethodForMergePartFailures.PartsCannotBeMerged Property
 This PartMaker refers to parts which cannot be merged.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartsCannotBeMerged { get; }
Public Shared ReadOnly Property PartsCannotBeMerged As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartsCannotBeMerged {
	FailureDefinitionId^ get ();
}
static member PartsCannotBeMerged : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PartMakerMethodForMergePartFailures Class
Autodesk.Revit.DB Namespace